Revit 2024 API
FilteredWorksetIdIterator.Current Property
Gets the item at the current position of the iterator.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual WorksetId Current { get; }
Visual Basic
Public Overridable ReadOnly Property Current As WorksetId
	Get
Visual C++
public:
virtual property WorksetId^ Current {
	WorksetId^ get ();
}
Implements
IEnumerator<T>.Current
Remarks
There is no current item if the iterator has not started yet or has been done.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  There is no current item in the iterator.
See Also
FilteredWorksetIdIterator Class
Autodesk.Revit.DB Namespace